# How do I find and remove duplicate rows in pandas?

In [22]:
import pandas as pd

In [23]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols, index_col='user_id')

In [24]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [25]:
users.shape

(943, 4)

In [26]:
users['zip_code'].duplicated().sum()

148

In [27]:
users.duplicated().sum()
# There are 7 rows are duplicated here

7

In [28]:
users.loc[users.duplicated(keep=False), :]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [29]:
users.drop_duplicates(keep=False).shape

(929, 4)

In [30]:
users.shape

(943, 4)

In [33]:
users.drop_duplicates(subset=['age', 'zip_code']).shape

(927, 4)

: